alexandremgo/TM4C123G_FreeRTOS_template/startup_TM4C123GH6PM.c
/* reset handler -----------------------------------------------------------*/
void Reset_Handler(void) {
    extern int main(void);
    extern int __libc_init_array(void);
    extern unsigned __data_start;  /* start of .data in the linker script */
    extern unsigned __data_end__;  /* end of .data in the linker script */
    extern unsigned const __data_load; /* initialization values for .data  */
    extern unsigned __bss_start__; /* start of .bss in the linker script */
    extern unsigned __bss_end__;   /* end of .bss in the linker script */
    extern void software_init_hook(void) __attribute__((weak));

    unsigned const *src;
    unsigned *dst;

    SystemInit(); /* CMSIS system initialization. */

    /* copy the data segment initializers from flash to RAM... */
    src = &__data_load;
    for (dst = &__data_start; dst < &__data_end__; ++dst, ++src) {
        *dst = *src;
    }

    /* zero fill the .bss segment in RAM... */
    for (dst = &__bss_start__; dst < &__bss_end__; ++dst) {
        *dst = 0;
    }

    /* init hook provided? */
    if (&software_init_hook != (void (*)(void))(0)) {
        /* give control to the RTOS */
        software_init_hook(); /* this will also call __libc_init_array */
    }
    else {
        /* call all static constructors in C++ (harmless in C programs) */
        __libc_init_array();
        (void)main(); /* application's entry point; should never return! */
    }

    /* the previous code should not return, but assert just in case... */
    assert_failed("Reset_Handler", __LINE__);
}

// __attribute__((naked)) will not access the stack

/* fault exception handlers ------------------------------------------------*/
__attribute__((naked)) void NMI_Handler(void) {
    assert_failed("NMI_Handler", __LINE__);
}
/*..........................................................................*/
__attribute__((naked)) void MemManage_Handler(void) {
    assert_failed("MemManage_Handler", __LINE__);
}
/*..........................................................................*/
__attribute__((naked)) void HardFault_Handler(void) {
    assert_failed("HardFault_Handler", __LINE__);
}
/*..........................................................................*/
__attribute__((naked)) void BusFault_Handler(void) {
    assert_failed("BusFault_Handler", __LINE__);
}
/*..........................................................................*/
__attribute__((naked)) void UsageFault_Handler(void) {
    assert_failed("UsageFault_Handler", __LINE__);
}
/*..........................................................................*/
__attribute__((naked)) void Default_Handler(void) {
    assert_failed("Default_Handler", __LINE__);
}

/* This function is defined in assembly to avoid accessing the stack,
 * which might be corrupted by the time assert_failed is called. */
__attribute__((naked)) void assert_failed(char const *file, int line)
{
    /* re-set the SP in case of stack overflow */
    __asm volatile (
            "  MOV sp,%0\n\t"
            : : "r" (&__stack_end__));

    /* TBD: damage control */

    /* Reset the system. */
    NVIC_SystemReset();
}
